/******************************************************
 * 클래스기능 : 수학관련 속성과 기능 구성된 클래스
 * 클래스이름 : Math
 * 클래스속성 : -
 * 클래스 메서드 : 합계, 평균
 *****************************************************/
public class Math {
	// 멤버 속성
	
	//메서드 - 생성자 메서드(Constructor) : 클래스명과 동일한 메서드 명
	//								  반환값 미지정
	// Defalut 생성자
	Math(){
		System.out.println("Math 생성자");
	}
	
	// 메서드 - 인스턴스
	/***************************************************
	 * 메서드이름 : getSum
	 * 매개변수들 : 정수 3개 int a, int b, int c
	 * 메소드결과 : 합계 즉, int
	 ****************************************************/
	int getSum(int a, int b, int c) {
		return a+b+c;
	}
	
	/***************************************************
	 * 메서드이름 : getSum
	 * 매개변수들 : 정수 3개 float a, float b, float c
	 * 메소드결과 : 합계 즉, float
	 ****************************************************/
	float getSum(float a, float b, float c) {
		return a+b+c;
	}
	
	/*******************************************************
	 * 메서드이름 : getAverage
	 * 매개변수들 : 정수 3개 int a, int b, int c
	 * 메소드결과 : 평균 즉, float
	 *************************************************/
	float getAverage(int a, int b, int c) {
		return (a+b+c)/3.f;
	}
}
